
import React from 'react';
import { City } from './types';

export const RUSSIAN_CITIES: City[] = [
  { id: '1', name: 'Москва' },
  { id: '2', name: 'Санкт-Петербург' },
  { id: '3', name: 'Новосибирск' },
  { id: '4', name: 'Екатеринбург' },
  { id: '5', name: 'Казань' },
  { id: '6', name: 'Нижний Новгород' },
  { id: '7', name: 'Челябинск' },
  { id: '8', name: 'Самара' },
  { id: '9', name: 'Омск' },
  { id: '10', name: 'Ростов-на-Дону' },
  { id: '11', name: 'Уфа' },
  { id: '12', name: 'Красноярск' },
  { id: '13', name: 'Воронеж' },
  { id: '14', name: 'Пермь' },
  { id: '15', name: 'Волгоград' },
  { id: '16', name: 'Краснодар' },
  { id: '17', name: 'Саратов' },
  { id: '18', name: 'Тюмень' },
  { id: '19', name: 'Тольятти' },
  { id: '20', name: 'Ижевск' },
  { id: '21', name: 'Барнаул' },
  { id: '22', name: 'Ульяновск' },
  { id: '23', name: 'Иркутск' },
  { id: '24', name: 'Хабаровск' },
  { id: '25', name: 'Ярославль' },
  { id: '26', name: 'Владивосток' },
  { id: '27', name: 'Махачкала' },
  { id: '28', name: 'Томск' },
  { id: '29', name: 'Оренбург' },
  { id: '30', name: 'Кемерово' },
  { id: '31', name: 'Вологда' },
  { id: '32', name: 'Волжск' },
  { id: '33', name: 'Волжский' },
];

export const CARGO_COMPANIES = ["СДЭК", "Boxberry", "Почта России", "Деловые Линии", "ПЭК", "Энергия"];
